/*
Напишите функцию getPrototypeChain(obj), которая будет
возвращать цепочку прототипов для заданного объекта
obj. Функция должна вернуть массив прототипов, начиная
от самого объекта и заканчивая глобальным объектом
Object.prototype.
*/

//todo


const obg = {};
const prototypeChain = getPrototypeChain(obj);
console.log((prototypeChain));


/*
Создайте класс Animal, который будет представлять животное. У
класса Animal должны быть следующие свойства и методы:
● Свойство name (строка) - имя животного.
● Метод speak() - выводит в консоль звук, издаваемый животным.
Создайте подкласс Dog, который наследует класс Animal. Для
подкласса Dog добавьте дополнительное свойство и метод:
● Свойство breed (строка) - порода собаки.
● Метод fetch() - выводит в консоль сообщение "Собака [name]
принесла мяч.".
*/





/*
Создайте класс Product, который будет представлять товар в магазине.
У товара должны быть следующие свойства:
• name (строка) - имя товара.
• price (число) - цена товара за одну единицу.
Создайте класс ShoppingCart, представляющий корзину интернет-магазина.
Конструктор класса ShoppingCart должен принимать два параметра:
• customerName (строка) - имя покупателя.
(число)
• initialTotalCost (число) - |
(может быть равна 0, если корзина пуста).
начальная общая СТОИМОСТЬ заказа может быть равна 0, корзина пуста
*/







